Documents/ESB/ESB_Consumer_0623/003TestSample/SAMPLE_XML_MUST/PaymentOrder/PO04_TWDFundXferAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/PaymentOrder/TWDFundXferAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>PaymentOrder</ServiceDomain>  
      <OperationName>TWDFundXferAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:TWDFundXferAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>PO04</v11:TxnId>  
        <v11:TxnNo>PO0400001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:ChanId>APP</v11:ChanId>  
        <!--Optional:-->  
        <v11:DbBankId>825</v11:DbBankId>  
        <v11:DbAcctNo>29887923</v11:DbAcctNo>  
        <v11:DbAmt>20000</v11:DbAmt>  
        <v11:CrBankId>009</v11:CrBankId>  
        <v11:CrAcctNo>23239232</v11:CrAcctNo>  
        <!--Optional:-->  
        <v11:TermChkCode>02398233</v11:TermChkCode>  
        <!--Optional:-->  
        <v11:ICCMemo>備註</v11:ICCMemo>  
        <!--Optional:-->  
        <v11:ICCSeqNo>29823203</v11:ICCSeqNo>  
        <!--Optional:-->  
        <v11:ICCTAC>A0A1A2A3A4A5A6A7A8</v11:ICCTAC>  
        <!--Optional:-->  
        <v11:SameIdFlg>1</v11:SameIdFlg>  
        <v11:TxnType>1234</v11:TxnType>  
        <v11:DgtlAcctType>3A</v11:DgtlAcctType>  
        <v11:TxnNo>2468013579</v11:TxnNo>  
        <v11:ChanTxnNo>1357902468</v11:ChanTxnNo> 
      </v11:ServiceBody> 
    </v11:TWDFundXferAddRq> 
  </soap:Body> 
</soap:Envelope>
